feed_me/app/controllers/recipes_controller.rb

    def create
        @recipe = Recipe.new(recipe_params)
        if @recipe.save
---
INSERT INTO "recipes" ("name", "meal_image", "cuisine", "region", "cook_time", "ingredients1", "ingredients2", "ingredients3", "ingredients4", "ingredients5", "ingredients6", "ingredients7", "ingredients8", "ingredients9", "ingredients10", "measurements1", "measurements2", "measurements3", "measurements4", "measurements5", "measurements6", "measurements7", "measurements8", "measurements9", "measurements10", "servings", "instructions", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30) RETURNING "id"

    def update
        @recipe = Recipe.find(params[:id])

        if @recipe.update(recipe_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "recipes" SET "name" = $1, "meal_image" = $2, "cuisine" = $3, "region" = $4, "cook_time" = $5, "instructions" = $6, "ingredients1" = $7, "ingredients2" = $8, "ingredients3" = $9, "ingredients4" = $10, "ingredients5" = $11, "ingredients6" = $12, "ingredients7" = $13, "ingredients8" = $14, "ingredients9" = $15, "measurements1" = $16, "measurements2" = $17, "measurements3" = $18, "measurements4" = $19, "measurements5" = $20, "measurements6" = $21, "measurements7" = $22, "measurements8" = $23, "measurements9" = $24, "updated_at" = $25 WHERE "recipes"."id" = $26

    def destroy
        @recipe = Recipe.find(params[:id])
        @recipe.destroy
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 3]]